## Terraform Plans 🌍

<details>
<summary><b>DEV</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core_workspace.fabric_lakehouse.core will be created
  + resource "fabric_lakehouse" "core" {
      + description  = "Core lakehouse for dev environment"
      + display_name = "core_lakehouse_dev"
      + id           = (known after apply)
      + properties   = (known after apply)
      + workspace_id = (known after apply)
    }

  # module.core_workspace.fabric_variable_library.deployment will be created
  + resource "fabric_variable_library" "deployment" {
      + definition_update_enabled = true
      + description               = "Variable library for Fabric deployment pipelines - Dev environment"
      + display_name              = "deployment_variables_dev"
      + id                        = (known after apply)
      + properties                = (known after apply)
      + workspace_id              = (known after apply)
    }

  # module.core_workspace.fabric_warehouse.core will be created
  + resource "fabric_warehouse" "core" {
      + description  = "Core warehouse for dev environment"
      + display_name = "core_warehouse_dev"
      + id           = (known after apply)
      + properties   = (known after apply)
      + workspace_id = (known after apply)
    }

  # module.core_workspace.fabric_workspace.core will be created
  + resource "fabric_workspace" "core" {
      + capacity_assignment_progress = (known after apply)
      + capacity_id                  = "01CA0BA8-FCEE-4FB2-A296-C131D0DEC5B6"
      + capacity_region              = (known after apply)
      + description                  = "Core Fabric workspace - Dev environment"
      + display_name                 = "fabric-core-dev"
      + id                           = (known after apply)
      + onelake_endpoints            = (known after apply)
      + type                         = (known after apply)
    }

  # module.core_workspace.fabric_workspace_role_assignment.admin will be created
  + resource "fabric_workspace_role_assignment" "admin" {
      + id           = (known after apply)
      + principal    = {
          + id   = (known after apply)
          + type = "Group"
        }
      + role         = "Admin"
      + workspace_id = (known after apply)
    }

  # module.core_workspace.fabric_workspace_role_assignment.contributor will be created
  + resource "fabric_workspace_role_assignment" "contributor" {
      + id           = (known after apply)
      + principal    = {
          + id   = (known after apply)
          + type = "Group"
        }
      + role         = "Contributor"
      + workspace_id = (known after apply)
    }

  # module.core_workspace.terraform_data.warehouse_schemas will be created
  + resource "terraform_data" "warehouse_schemas" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # module.entra_groups.azuread_group.core_admins will be created
  + resource "azuread_group" "core_admins" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Admin access to Core workspace - dev environment"
      + display_name                   = "lbn_SG-Fabric-Core-dev-Admins"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.entra_groups.azuread_group.core_contributors will be created
  + resource "azuread_group" "core_contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Contributor access to Core workspace - dev environment (Data Engineers & Analysts)"
      + display_name                   = "lbn_SG-Fabric-Core-dev-Contributors"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + core_variable_library_id = (known after apply)
  + core_workspace_id        = (known after apply)
  + core_workspace_name      = "fabric-core-dev"
  + domain_workspace_ids     = {}
  + domain_workspace_names   = {}

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

<details>
<summary><b>TEST</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core_workspace.fabric_lakehouse.core will be created
  + resource "fabric_lakehouse" "core" {
      + description  = "Core lakehouse for test environment"
      + display_name = "core_lakehouse_test"
      + id           = (known after apply)
      + properties   = (known after apply)
      + workspace_id = (known after apply)
    }

  # module.core_workspace.fabric_variable_library.deployment will be created
  + resource "fabric_variable_library" "deployment" {
      + definition_update_enabled = true
      + description               = "Variable library for Fabric deployment pipelines - Test environment"
      + display_name              = "deployment_variables_test"
      + id                        = (known after apply)
      + properties                = (known after apply)
      + workspace_id              = (known after apply)
    }

  # module.core_workspace.fabric_warehouse.core will be created
  + resource "fabric_warehouse" "core" {
      + description  = "Core warehouse for test environment"
      + display_name = "core_warehouse_test"
      + id           = (known after apply)
      + properties   = (known after apply)
      + workspace_id = (known after apply)
    }

  # module.core_workspace.fabric_workspace.core will be created
  + resource "fabric_workspace" "core" {
      + capacity_assignment_progress = (known after apply)
      + capacity_id                  = "01CA0BA8-FCEE-4FB2-A296-C131D0DEC5B6"
      + capacity_region              = (known after apply)
      + description                  = "Core Fabric workspace - Test environment"
      + display_name                 = "fabric-core-test"
      + id                           = (known after apply)
      + onelake_endpoints            = (known after apply)
      + type                         = (known after apply)
    }

  # module.core_workspace.fabric_workspace_role_assignment.admin will be created
  + resource "fabric_workspace_role_assignment" "admin" {
      + id           = (known after apply)
      + principal    = {
          + id   = (known after apply)
          + type = "Group"
        }
      + role         = "Admin"
      + workspace_id = (known after apply)
    }

  # module.core_workspace.fabric_workspace_role_assignment.contributor will be created
  + resource "fabric_workspace_role_assignment" "contributor" {
      + id           = (known after apply)
      + principal    = {
          + id   = (known after apply)
          + type = "Group"
        }
      + role         = "Contributor"
      + workspace_id = (known after apply)
    }

  # module.core_workspace.terraform_data.warehouse_schemas will be created
  + resource "terraform_data" "warehouse_schemas" {
      + id               = (known after apply)
      + triggers_replace = [
          + (known after apply),
        ]
    }

  # module.entra_groups.azuread_group.core_admins will be created
  + resource "azuread_group" "core_admins" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Admin access to Core workspace - test environment"
      + display_name                   = "lbn_SG-Fabric-Core-test-Admins"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.entra_groups.azuread_group.core_contributors will be created
  + resource "azuread_group" "core_contributors" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Contributor access to Core workspace - test environment (Data Engineers & Analysts)"
      + display_name                   = "lbn_SG-Fabric-Core-test-Contributors"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = false
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + core_variable_library_id = (known after apply)
  + core_workspace_id        = (known after apply)
  + core_workspace_name      = "fabric-core-test"
  + domain_workspace_ids     = {}
  + domain_workspace_names   = {}

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
</details>

<details>
<summary><b>PROD</b> Environment</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.domain_workspace["demo_domain"].fabric_workspace.domain: Refreshing state... [id=c8afb601-d078-452d-ba2b-aee9d08002f5]
module.core_workspace.fabric_workspace.core: Refreshing state... [id=7c3dc78e-2712-4cf4-bf31-286bbe90283c]
module.entra_groups.azuread_group.app_viewers_org[0]: Refreshing state... [id=3869c8f4-4f83-496a-a6cf-29a8683acb1f]
module.entra_groups.azuread_group.core_contributors: Refreshing state... [id=48410d02-281d-4f96-852e-1d1b2a0d5920]
module.entra_groups.azuread_group.app_viewers_domain["demo_domain"]: Refreshing state... [id=f9a76cb0-cbcc-4f4b-b1e6-93e3d6721f0e]
module.entra_groups.azuread_group.business_admins["demo_domain"]: Refreshing state... [id=9785fbe4-b062-4759-a241-773a61faa1b3]
module.entra_groups.azuread_group.cicd_approvers[0]: Refreshing state... [id=b897f037-a875-40b3-8554-a558fb6cb3d4]
module.entra_groups.azuread_group.core_admins: Refreshing state... [id=d44ab011-11e8-46fd-9eaf-3285880f1418]
module.entra_groups.azuread_group.platform_admins[0]: Refreshing state... [id=0b5109fd-464e-4477-8212-f4b9ac52c887]
module.entra_groups.azuread_group.business_contributors["demo_domain"]: Refreshing state... [id=d6459149-355d-4e0e-a7ba-d5c2ae67a5e9]
module.core_workspace.fabric_variable_library.deployment: Refreshing state... [id=0d571564-27c6-43bb-bf81-fcf4f6248467]
module.core_workspace.fabric_lakehouse.core: Refreshing state... [id=ec9d3729-8d74-4d46-90f1-699818a13001]
module.core_workspace.fabric_workspace_role_assignment.contributor: Refreshing state... [id=48410d02-281d-4f96-852e-1d1b2a0d5920]
module.core_workspace.fabric_workspace_role_assignment.admin: Refreshing state... [id=d44ab011-11e8-46fd-9eaf-3285880f1418]
module.core_workspace.fabric_warehouse.core: Refreshing state... [id=583d0e17-9c9e-4de0-960d-7348f0738163]
module.core_workspace.terraform_data.warehouse_schemas: Refreshing state... [id=7a70496b-0617-026d-c2af-38122e3e694e]
module.domain_workspace["demo_domain"].fabric_workspace_role_assignment.admin: Refreshing state... [id=0b5109fd-464e-4477-8212-f4b9ac52c887]
module.domain_workspace["demo_domain"].fabric_lakehouse.domain: Refreshing state... [id=9a931d1c-efeb-474f-a399-b43d2382b12c]
module.domain_workspace["demo_domain"].fabric_shortcut.warehouse_gold: Refreshing state... [id=c8afb601-d078-452d-ba2b-aee9d08002f59a931d1c-efeb-474f-a399-b43d2382b12cTablescore_warehouse_gold]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Warning: 'Shortcut' preview mode

  with module.domain_workspace["demo_domain"].fabric_shortcut.warehouse_gold,
  on modules/domain-workspace/main.tf line 36, in resource "fabric_shortcut" "warehouse_gold":
  36: resource "fabric_shortcut" "warehouse_gold" {

The 'Shortcut' behavior may change in future releases without notice or
compatibility guarantees.

(and one more similar warning elsewhere)
Releasing state lock. This may take a few moments...

```
</details>

